coffee_notes_api/app/controllers/api/v1/flavors_controller.rb

  def index
    @country = Country.find(params[:country_id].to_i)
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]