coffee_notes_api/app/controllers/api/v1/flavors_controller.rb

SELECT "flavors".* FROM "flavors" INNER JOIN "profiles" ON "flavors"."id" = "profiles"."flavor_id" WHERE "profiles"."country_id" = ?  [["country_id", 1]]
---
  def show
    @flavor = @country.flavor.find(params[:id])

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_country
    @country = Country.find(params[:country_id])