coffee_notes_api/app/controllers/api/v1/profiles_controller.rb

SELECT "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @country = Country.find(params[:country_id].to_i)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "profiles" SET "votes" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["votes", 1], ["updated_at", "2021-02-05 22:49:46.718743"], ["id", 14]]
---
  def update
    @profile = Profile.find(params[:id].to_i)
    @profile.votes = @profile.votes + 1
    @profile.save